# Используем официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем зависимости
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем код приложения
COPY ./app ./app

# Команда запуска Uvicorn
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0", "--port", "8080"]

### Практика:
# 1. добавьте в корень приложения папку templates/
# 2. добавьте Jinja-шаблон templates/index.html,
#     который отдается по пути /
# 3. При каждом входе на страницу увеличивайте
#    счетчик посещений, хранящийся в переменной visits
# 4. На странице index.html выводите сообщение
#    "Сайт посещен {visits} раз"
# 5. Запустите приложение в 2 отдельных контейнерах
#     - на порту 3000
#     - на порту 3001

